app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos=$this->productos->where('activo',$activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function nuevo()
    {
        $unidades=$this->unidades->where('activo',1)->findAll();
        $categorias=$this->categorias->where('activo',1)->findAll();

INSERT INTO `productos` (`codigo`, `nombre`, `precio_venta`, `precio_compra`, `stock_minimo`, `inventariable`, `id_unidad`, `id_categoria`, `fecha_alta`) VALUES ('4321', 'azucar', '3.00', '2.00', '5', '1', '1', '5', '2023-01-06 06:08:35')
---
    public function insertar()
    {
        if($this->request->getMethod() == "post" && $this->validate($this->reglas)){


        $this->productos->save([
        'codigo'=> $this->request->getPost('codigo'),
        'nombre'=> $this->request->getPost('nombre'),
        'precio_venta'=> $this->request->getPost('precio_venta'),
        'precio_compra'=> $this->request->getPost('precio_compra'),
        'stock_minimo'=> $this->request->getPost('stock_minimo'),
        'inventariable'=> $this->request->getPost('inventariable'),
        'id_unidad'=> $this->request->getPost('id_unidad'),
        'fecha_vencimiento'=>$this->request->getPost('fecha_vencimiento'),
        'id_categoria'=> $this->request->getPost('id_categoria')]);

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `id` = '19'
 LIMIT 1
---
    public function editar($id)
    {
        $unidades=$this->unidades->where('activo',1)->findAll();
        $categorias=$this->categorias->where('activo',1)->findAll();
        $producto=$this->productos->where('id', $id)->first();

UPDATE `productos` SET `codigo` = '4321', `nombre` = 'azucar', `precio_venta` = '3.00', `precio_compra` = '2.00', `stock_minimo` = '5', `inventariable` = '1', `id_unidad` = '1', `fecha_vencimiento` = '10/02/2023', `id_categoria` = '5'
WHERE `productos`.`id` IN ('19')
---
    public function actualizar()
    {
        $this->productos->update($this->request->getPost('id'),[
            'codigo'=> $this->request->getPost('codigo'),
            'nombre'=> $this->request->getPost('nombre'),
            'precio_venta'=> $this->request->getPost('precio_venta'),
            'precio_compra'=> $this->request->getPost('precio_compra'),
            'stock_minimo'=> $this->request->getPost('stock_minimo'),
            'inventariable'=> $this->request->getPost('inventariable'),
            'id_unidad'=> $this->request->getPost('id_unidad'),
            'fecha_vencimiento'=>$this->request->getPost('fecha_vencimiento'),
            'id_categoria'=> $this->request->getPost('id_categoria')]);